Atul-8/esp32c6-ble-ota/firmware/sdkconfig.defaults
# ESP32-C6 BLE OTA — sdkconfig.defaults
# 仅在 sdkconfig 首次生成时生效（set-target / 删除旧 sdkconfig 后）

# Target
CONFIG_IDF_TARGET="esp32c6"

# Partition Table：自定义双 OTA 槽
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y

# Flash
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# Bluetooth: NimBLE host（ble_ota 组件 nimble 模式）
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ATT_PREFERRED_MTU=517
CONFIG_BT_NIMBLE_HOST_TASK_STACK_SIZE=6144

# BLE 广播设备名（ERR-006）：vendor 组件 components/ble_ota 的 Kconfig 项，
# 组件在 host task 启动前 name_set，广播字段构造读取的即为该值（消除竞态）
CONFIG_BLE_OTA_DEVICE_NAME="C6-OTA-1128"

# OTA 版本回滚（issue #2）：新镜像首启 PENDING_VERIFY，由 ota_rollback_confirm 确认
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y

# main 任务栈（BLE 接线 + 轮询日志）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144
